---
kind: type
id: T:Autodesk.Revit.DB.ComponentRotation
source: html/6ce762bd-8660-bb13-1294-b1334a1fdf5e.htm
---
# Autodesk.Revit.DB.ComponentRotation

ComponentRotation property of DividedSurface.
See DividedSurface .

## Syntax (C#)
```csharp
public enum ComponentRotation
```